let questions = [
    {
        "question": "清晨你正走在大街上，這時你看到一個小混混正在欺負一位小學生，為了打抱不平，你決定走上前去阻止，你開口的第一句話是？",
        "answers": [
            ["給我記好了，我只是個路過的假面騎士", 2],
            ["天在呼喚、地在呼喚、人在呼喚，呼喚我打敗邪惡！我是正義的戰士", 2],
            ["變身！", 2]
        ]
    },
    {
        "question": "當你說出了這句台詞過後，對面的小混混先是一愣，然後直接把你撂翻在地，此時你突然感覺有一個聲音在腦後中響起，並且你的手中也多了一個物品，你定眼一看，你發現該物品會是？",
        "answers": [
            ["假面騎士exaid的玩家驅動器", 3],
            ["假面騎士時王的時空驅動器", 3],
            ["假面騎士Build驅動器", 3]
        ]
    },
    {
        "question": "你成功的變身成假面騎士並輕鬆打倒了對手，這時剛才聲音的主人也出現在了你的面前，你發現他就是鼎鼎大名的假面騎士BlackRX，他說你已經有資格成為一名合格的騎士，你現在要挑選一位騎士作為自己的二騎，你的選擇是？",
        "answers": [
            ["強大且酷愛演戲的假面騎士Kaixa", 4],
            ["藍色之魂假面騎士Specter", 4],
            ["傳奇騎士之力假面騎士蓋茨", "C"]
        ]
    },
    {
        "question": "當你成功選擇了自己的二騎過後，你面前出現了多個魔人形象的角色，他們自稱為奧菲爾諾，並且向你與二騎發起了挑戰，為了不讓戰鬥波及到周圍，你選擇了場景切換，接著你們切換到了？",
        "answers": [
            ["假面騎士Faiz的體育場館", 5],
            ["草加雅人的陽光沙灘", 5],
            ["假面騎士W的地下水道", 5]
        ]
    },
    {
        "question": "經過了一番苦戰，你們終於戰勝了對手並獲得了戰鬥的勝利，為了感謝帶領你走入假面騎士世界的RX，以及與你並肩作戰的二騎，你覺得要向他們說點感謝的話語，你決定說？",
        "answers": [
            ["我來成為你最後的希望", "B"],
            ["我們不是為自己而戰，我們是我人類的自由而戰，我們是假面騎士", "D"],
            ["今晚去吃烤肉吧", "A"]
        ]
    }
];

let finalAnswers = {
    "A": ["Decade", "說明當你獲得假面騎士之力後，你會成為劇中的假面騎士王小明，王小明本名門矢士，他是一位喜愛收集卡片的假面騎士，當你成為他過後，你也能獲得大量的假面騎士卡片。"],
    "B": ["龍騎", "說明當你得到假面騎士之力後，你會成為劇中的假面騎士龍騎，龍騎是能夠進入鏡子世界的存在，當你成為龍騎後你就能自由的在鏡子領域探險。"],
    "C": ["時王", "說明當你得到假面騎士之力後，你會成為劇中的假面騎士時王，時王是一位想要改變命運的魔王，當你成為時王過後，你也必須擔負起需要改變的命運。"],
    "D": ["BlackRX", "說明當你得到假面騎士之力後，你會成為假面騎士BlackRX，RX是假面騎士里很經典的形象，一旦成為了RX你就能獲得迷妹們的喜愛。"]
};